Emacs.org
#+TITLE: Emacs.org
#+AUTHOR: Christian Elliott
#+PROPERTY: header-args:emacs-lisp :tangle init.el

# References:
# * Nice literate config; most of my stuff comes from here: https://github.com/alhassy/emacs.d
# * Awesome Emacs list: https://github.com/emacs-tw/awesome-emacs#editing
# * Table of MANY good Emacs configs: https://github.com/caisah/emacs.dz
# * https://github.com/angrybacon/dotemacs/blob/master/dotemacs.org
# * https://jamiecollinson.com/blog/my-emacs-config/
# * https://github.com/daviwil/dotfiles/blob/master/Emacs.org

* Notes
** =use-package=
   Use =:tangle no= in the =#+begin_src= header to disable tangling for that block.

   For =use-package= directives:
  #+BEGIN_QUOTE
   The :disabled keyword can turn off a module you're having difficulties with,
   or stop loading something you're not using at the present time
  #+END_QUOTE
* TODO Get Consult set up for minibuffer completion
  Also install consult-lsp.

#+BEGIN_QUOTE 
  When using lsp, it is likely that you will encounter programming errors. To
  navigate through these errors via the minibuffer, you can use a package for
  that. If like me, you use consult with your minibuffer completion, then
  consult-lsp is made for you.
#+END_QUOTE

#+BEGIN_SRC emacs-lisp :tangle no
  (use-package consult-lsp
    ;; :disabled
    :commands (consult-lsp-diagnostics consult-lsp-symbols))
#+END_SRC

* TODO Use dap-mode for Debug Adapter Protocol for debugging
  Why?! Why do I add these TODOs?
  
* Personal Information
  
#+BEGIN_SRC emacs-lisp
  (setq user-full-name "Christian Elliott"
        user-mail-address "cdelliott96@gmail.com")
#+END_SRC

* Packages & Initial Setup

** Setup Package Archives and use-package

   #+begin_src emacs-lisp
     (setq package-archives
	   '(("gnu" . "https://elpa.gnu.org/packages/") ; Should I change this to elpa?
	     ("melpa" . "https://melpa.org/packages/")))

     ;; I really should know more about the next ~ 5 lines.
     (package-initialize)
     (unless (package-installed-p 'use-package)
       (package-refresh-contents)
       (package-install 'use-package))
     (require 'package)
     (require 'use-package)

     (use-package use-package-ensure-system-package 
       :ensure t)
   #+end_src

** Async

   #+BEGIN_SRC emacs-lisp
     (use-package async
       :init
       (autoload 'dired-async-mode "dired-async.el" nil t)
       (dired-async-mode 1)
       (async-bytecomp-package-mode 1)
       (autoload 'dired-async-mode "dired-async.el" nil t)
       (async-bytecomp-package-mode 1)
       (dired-async-mode 1))
   #+END_SRC

* Operating System
** Detect the OS

#+BEGIN_SRC emacs-lisp
  (defun is-mac-p
      ()
    (eq system-type 'darwin))

  (defun is-linux-p
      ()
    (eq system-type 'gnu/linux))

  (defun is-windows-p
      ()
    (or
     (eq system-type 'ms-dos)
     (eq system-type 'windows-nt)
     (eq system-type 'cygwin)))

  (defun is-bsd-p
      ()
    (eq system-type 'gnu/kfreebsd))
#+END_SRC
   
** Start Emacs server (primarily useful on Darwin)

   #+BEGIN_SRC emacs-lisp
     (server-start)
   #+END_SRC
   
** Disable visible bell if on Linux

   #+BEGIN_SRC emacs-lisp
     (setq ring-bell-function 'ignore)
   #+END_SRC

* LSP

  The main benefit of using Language Server Protocol (LSP) to configure the management of your programming languages is that LSP servers are also used by other text editors, increasing contributions to these packages. What could be better than benefiting from the larger community, while keeping a quality text editor ;-)

We need a Language Server Protocol (LSP) client to use different LSP servers according to the programming languages that we would like to use. That’s where lsp-mode comes in!

  #+BEGIN_SRC emacs-lisp
    (use-package lsp-mode
      :commands (lsp lsp-deferred)
      :hook ((prog-mode . lsp-deferred)
	     (lsp-mode . lsp-enable-which-key-integration))
      :custom
      (lsp-enable-folding nil)
      (lsp-enable-links nil)
      (lsp-enable-snippet nil)
      (lsp-keymap-prefix "C-c ;")
      (read-process-output-max (* 1024 1024)))
  #+END_SRC

  In addition to lsp-mode, it is possible to use lsp-ui to get additional information (e.g., documentation) when hovering a variable or a function.

  #+BEGIN_SRC emacs-lisp
    (use-package lsp-ui
      :hook (lsp-mode . lsp-ui-mode))
  #+END_SRC

* Full screen
  
** Make toggle full screen available on OSX
   #+BEGIN_SRC emacs-lisp
     (when (is-mac-p)
       (defun toggle-fullscreen ()
         "Toggle full screen"
         (interactive)
         (set-frame-parameter
          nil 'fullscreen
          (when (not (frame-parameter nil 'fullscreen)) 'fullboth)))
       )
   #+END_SRC

   Note: to maximize the window instead of making it fullscreen, use =toggle-frame-maximized=. Works out of the box.
   
* TeX

  #+BEGIN_SRC emacs-lisp
    (use-package tex
      :ensure auctex)
  #+END_SRC

* =ls= vs =gls= (for OSX Dired issues)

  Checks if we're on OSX and sets =insert-directory-program= appropriately.

  Not sure if the second value (=dired-use-ls-dired t=) is necessary, but it works.

#+BEGIN_SRC emacs-lisp
  (when (is-mac-p)
    (setq insert-directory-program "gls" dired-use-ls-dired t)

    ;; For LaTex settings or for fixing errors like =org-create-formula-image: Can’t find ‘latex’ (you need to install the programs: latex and dvipng.)=
    (setenv "PATH" (concat "/Library/TeX/texbin" (getenv "PATH")))
    (setq exec-path (append '("/Library/TeX/texbin") exec-path))
    )
#+END_SRC

* Anti-Aliasing (OSX)

#+BEGIN_SRC emacs-lisp
  (when (is-mac-p)
    (setq mac-allow-anti-aliasing t))
#+END_SRC

* Better Defaults

#+begin_src emacs-lisp
  (setq-default
   cursor-in-non-selected-windows t       ; Hide the cursor in non-selected windows
   fill-column 80                         ; Set width for automatic line breaks
   load-prefer-newer t                    ; Prefer the newest version of a file
   gc-cons-threshold (* 8 1024 1024)      ; Increase GC size
   help-window-select t                   ; Focus new help window when opened
   inhibit-startup-screen t               ; Disable start-up screen
   read-process-output-max (* 1024 1024)  ; Increase read size per process
   scroll-conservatively most-positive-fixnum ; Always scroll by one line
   scroll-margin 2                        ; Add a margin when scrolling vertically     !!
   select-enable-clipboard t)             ; Merge system's and Emacs' clipboard
  (delete-selection-mode 1)               ; Replace region when inserting text
  (fset 'yes-or-no-p 'y-or-n-p)           ; Replace yes/no prompts with y/n
  (put 'downcase-region 'disabled nil)    ; Enable downcase-region
  (put 'upcase-region 'disabled nil)      ; Enable upcase-region
  (set-default-coding-systems 'utf-8)     ; Default to utf-8 encoding
  (global-prettify-symbols-mode +1)       ; Prettify symbols
  (show-paren-mode 1)
  (column-number-mode 1)
  (global-hl-line-mode) ; TODO Make org-mode source code HL a different color
#+end_src

* Buffers
  
  #+BEGIN_SRC emacs-lisp
    (use-package ibuffer
      :ensure nil
      :preface
      (defvar protected-buffers '("*scratch*" "*Messages*")
	"Buffer that cannot be killed.")
      :bind ("C-x C-b" . ibuffer))
  #+END_SRC
  
* Trying out: move-text

  [[https://github.com/emacsfodder/move-text][move-text]] package allows to move the current line or if marked, the current region's lines.

  #+BEGIN_SRC emacs-lisp
    (use-package move-text
      :bind (("M-p" . move-text-up)
	     ("M-n" . move-text-down))
      :config (move-text-default-bindings))
  #+END_SRC

