init.el
(setq user-full-name "Christian Elliott"
      user-mail-address "cdelliott96@gmail.com")

(setq package-archives
      '(("gnu" . "https://elpa.gnu.org/packages/") ; Should I change this to elpa?
	("melpa" . "https://melpa.org/packages/")))

;; I really should know more about the next ~ 5 lines.
(package-initialize)
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))
(require 'package)
(require 'use-package)

(use-package use-package-ensure-system-package 
  :ensure t)

(use-package async
  :init
  (autoload 'dired-async-mode "dired-async.el" nil t)
  (dired-async-mode 1)
  (async-bytecomp-package-mode 1)
  (autoload 'dired-async-mode "dired-async.el" nil t)
  (async-bytecomp-package-mode 1)
  (dired-async-mode 1))

(defun is-mac-p
    ()
  (eq system-type 'darwin))

(defun is-linux-p
    ()
  (eq system-type 'gnu/linux))

(defun is-windows-p
    ()
  (or
   (eq system-type 'ms-dos)
   (eq system-type 'windows-nt)
   (eq system-type 'cygwin)))

(defun is-bsd-p
    ()
  (eq system-type 'gnu/kfreebsd))

(server-start)

(setq ring-bell-function 'ignore)

(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :hook ((prog-mode . lsp-deferred)
	 (lsp-mode . lsp-enable-which-key-integration))
  :custom
  (lsp-enable-folding nil)
  (lsp-enable-links nil)
  (lsp-enable-snippet nil)
  (lsp-keymap-prefix "C-c ;")
  (read-process-output-max (* 1024 1024)))

(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode))

(when (is-mac-p)
  (defun toggle-fullscreen ()
    "Toggle full screen"
    (interactive)
    (set-frame-parameter
     nil 'fullscreen
     (when (not (frame-parameter nil 'fullscreen)) 'fullboth)))
  )

(use-package tex
  :ensure auctex)

(when (is-mac-p)
  (setq insert-directory-program "gls" dired-use-ls-dired t)

  ;; For LaTex settings or for fixing errors like =org-create-formula-image: Can’t find ‘latex’ (you need to install the programs: latex and dvipng.)=
  (setenv "PATH" (concat "/Library/TeX/texbin" (getenv "PATH")))
  (setq exec-path (append '("/Library/TeX/texbin") exec-path))
  )

(when (is-mac-p)
  (setq mac-allow-anti-aliasing t))

(setq-default
 cursor-in-non-selected-windows t       ; Hide the cursor in non-selected windows
 fill-column 80                         ; Set width for automatic line breaks
 load-prefer-newer t                    ; Prefer the newest version of a file
 gc-cons-threshold (* 8 1024 1024)      ; Increase GC size
 help-window-select t                   ; Focus new help window when opened
 inhibit-startup-screen t               ; Disable start-up screen
 read-process-output-max (* 1024 1024)  ; Increase read size per process
 scroll-conservatively most-positive-fixnum ; Always scroll by one line
 scroll-margin 2                        ; Add a margin when scrolling vertically     !!
 select-enable-clipboard t)             ; Merge system's and Emacs' clipboard
(delete-selection-mode 1)               ; Replace region when inserting text
(fset 'yes-or-no-p 'y-or-n-p)           ; Replace yes/no prompts with y/n
(put 'downcase-region 'disabled nil)    ; Enable downcase-region
(put 'upcase-region 'disabled nil)      ; Enable upcase-region
(set-default-coding-systems 'utf-8)     ; Default to utf-8 encoding
(global-prettify-symbols-mode +1)       ; Prettify symbols
(show-paren-mode 1)
(column-number-mode 1)
(global-hl-line-mode) ; TODO Make org-mode source code HL a different color

(use-package ibuffer
  :ensure nil
  :preface
  (defvar protected-buffers '("*scratch*" "*Messages*")
    "Buffer that cannot be killed.")
  :bind ("C-x C-b" . ibuffer))

(use-package move-text
  :bind (("M-p" . move-text-up)
	 ("M-n" . move-text-down))
  :config (move-text-default-bindings))
