init.el

(setq org-hide-emphasis-markers t)

(use-package org-bullets
  :ensure t
  :config
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))

(setq org-startup-indented t
      org-src-tab-acts-natively t
      org-fontify-done-headline t
      org-pretty-entities t)

(setq-default prettify-symbols-alist '(("#+BEGIN_SRC" . "λ")
                                       ("#+END_SRC" . "λ")
                                       ("#+begin_src" . "λ")
                                       ("#+end_src" . "λ")
                                       (">=" . "≥")
                                       ("=>" . "⇨")))
(setq prettify-symbols-unprettify-at-point 'right-edge)
(add-hook 'org-mode-hook 'prettify-symbols-mode)

(custom-theme-set-faces
 'user
 (if (is-mac-p)
     '(variable-pitch ((t (:family "ETBembo" :height 220 :weight normal))))
   '(variable-pitch ((t (:family "ETBembo" :height 180 :weight normal)))))
 ;;'(fixed-pitch ((t ( :family "Consolas" :slant normal :weight normal :height 0.9 :width normal))))
 '(fixed-pitch ((t ( :family "Menlo" :slant normal :weight thin :height 160 :width normal)))))

(custom-theme-set-faces
 'user
 '(org-block                 ((t (:inherit fixed-pitch))))
 '(org-document-info-keyword ((t (:inherit (shadow fixed-pitch)))))
 '(org-property-value        ((t (:inherit fixed-pitch))) t)
 '(org-special-keyword       ((t (:inherit (font-lock-comment-face fixed-pitch)))))
 '(org-tag                   ((t (:inherit (shadow fixed-pitch) :weight bold))))
 '(org-verbatim              ((t (:inherit (shadow fixed-pitch))))))

(use-package org-pretty-tags
  :ensure t
  :config
  (setq org-pretty-tags-surrogate-strings
        (quote
         (("Work" . "")
          ("Home" . "")))))
(org-pretty-tags-global-mode)

(use-package org-fancy-priorities
  :ensure t
  :hook (org-mode . org-fancy-priorities-mode)
  :config
  (setq org-fancy-priorities-list '("⚡" "⬆" "⬇" "☕")))

(use-package org
  :init
  ;; Set org-agenda file(s)
  (setq org-agenda-files (list "~/ORG/master-TODO.org"))

  ;; turn on visual line mode for org buffers
  (add-hook 'org-mode-hook #'visual-line-mode)

  ;; turn on variable-pitch-mode in org buffers
  (add-hook 'org-mode-hook #'variable-pitch-mode)

  ;; tangle blocks on save
  ;; TODO: only enable this functionality in Emacs.org
  (add-hook 'org-mode-hook
            (lambda () (add-hook 'after-save-hook #'org-babel-tangle
                                 :append :local)))
  :custom
  (org-support-shift-select 'always)

  :config
  ;; https://stackoverflow.com/questions/11272236/how-to-make-formule-bigger-in-org-mode-of-emacs
  ;; Adjusts the scale of latex in .org files. C-h v org-format-latex-options for more info, or above link
  (setq org-format-latex-options (plist-put org-format-latex-options :scale 2.0))

  ;; Set org-agenda "Weekly" view to display 14 days
  ;; Can be day, week, month, year, or any number of days.
  ;; TODO: What is the difference in just setting the variable (like above)
  ;; as opposed to using "setq" like below?
  (setq org-agenda-span '14) )

(use-package ledger-mode
  :ensure t)

(use-package elpy
  :ensure t
  :init
  (elpy-enable))

;; (use-package company
;;   :bind (:map company-active-map
;; 	 ("C-n" . company-select-next)
;; 	 ("C-p" . company-select-previous))
;;   :config
;;   (setq company-idle-delay 0.3)
;;   (global-company-mode t))

(use-package company
  :after lsp-mode
  :hook (lsp-mode . company-mode)
  :custom
  (company-begin-commands '(self-insert-command))
  (company-idle-delay 0.5)
  (company-minimum-prefix-length 1)
  (company-show-quick-access t)
  (company-tooltip-align-annotations 't))

(use-package company-box
  :if (display-graphic-p)
  :after company
  :hook (company-mode . company-box-mode))

(use-package undo-tree
  :diminish
  :bind ("C-x u" . undo-tree-visualize)
  :config

  ;; Always on
  (global-undo-tree-mode)

  ;; Each node in tree gets timestamps
  (setq undo-tree-visualizer-timestamps t)

  ;; Show a diff window displaying changes between undo nodes
  (setq undo-tree-visualizer-diff t))

(use-package which-key
  :diminish
  :config (which-key-mode)
  (which-key-setup-side-window-bottom)
  (setq which-key-idle-delay 0.2))

(use-package doom-themes
  :config
  ;; (load-theme 'doom-gruvbox t)
  ;;(load-theme 'doom-gruvbox-light t)
  (load-theme 'doom-zenburn t)
  (doom-themes-org-config)
  (setq zenburn-use-variable-pitch t)
  (setq zenburn-scale-org-headlines t)
  (setq zenburn-scale-outline-headlines t))

(use-package zenburn-theme
  :disabled
  :config
  (load-theme 'zenburn t)
  :init
  ;; use variable-pitch fonts for some headings and titles
  (setq zenburn-use-variable-pitch t)

  ;; scale headings in org-mode
  (setq zenburn-scale-org-headlines t)

  ;; scale headings in outline-mode
  (setq zenburn-scale-outline-headlines t))

(use-package doom-modeline
  :init (doom-modeline-mode)
  :custom
  (doom-modeline-icon (display-graphic-p)))

(use-package solaire-mode
  :defer 0.1
  :custom (solaire-mode-remap-fringe t)
  :config (solaire-global-mode))

(use-package rainbow-delimiters
  :hook
  (prog-mode . rainbow-delimiters-mode))
