Emacs.org
* User Interface

  Interface cleanup

   #+begin_src emacs-lisp
     (setq inhibit-startup-message t)                ; Not sure if I need this given setting in Better Defaults
     (tool-bar-mode -1)                              ; Disable the toolbar
     (tooltip-mode -1)                               ; Disable tooltips
     (set-fringe-mode 10)                            ; Add fringe
     (menu-bar-mode -1)                              ; Disable the menu bar
     (setq visible-bell t)                           ; Activate visible bell
     (scroll-bar-mode 1)
   #+end_src

   Scrolling

   #+begin_src emacs-lisp
     (setq mouse-wheel-scroll-amount '(1 ((shift) . 1))) ;; one line at a time
     (setq mouse-wheel-progressive-speed nil) ;; don't accelerate scrolling
     (setq mouse-wheel-follow-mouse 't) ;; scroll window under mouse
     (setq scroll-step 1) ;; keyboard scroll one line at a time
     (setq use-dialog-box nil) ;; Disable dialog boxes since they weren't working in Mac OSX
   #+end_src

   Maximize screen by default

   Disable on MacOSX because it's forcing my screen to stay fullscreen??

   #+begin_src emacs-lisp :tangle no
     (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
     (add-to-list 'default-frame-alist '(fullscreen . maximized))
   #+end_src

   Line/column numbers customization

   #+begin_src emacs-lisp
     (column-number-mode)

     ;; Enable line numbers for some modes
     (dolist (mode '(text-mode-hook
		     prog-mode-hook
		     conf-mode-hook))
       (add-hook mode (lambda () (display-line-numbers-mode 1))))

     ;; Override some modes which derive from the above
     (dolist (mode '(org-mode-hook))
       (add-hook mode (lambda () (display-line-numbers-mode 0))))
   #+end_src

   Centered windows from rememberYou's config

   #+begin_src emacs-lisp
     (use-package centered-window
       :custom
       (cwm-centered-window-width 130)
       (cwm-frame-internal-border 0)
       (cwm-incremental-padding t)
       (cwm-incremental-padding-% 2)
       (cwm-left-fringe-ratio 0)
       (cwm-use-vertical-padding t)
       :config (centered-window-mode))
   #+end_src

   Switch window shows us numbers to hit when we want to switch to a different window

   #+begin_src emacs-lisp
     (use-package switch-window
       :bind (("C-x o" . switch-window)
	      ("C-x w" . switch-window-then-swap-buffer)))
   #+end_src

* Dired

   #+begin_src emacs-lisp
     (use-package dired
       :ensure nil
       :commands (dired dired-jump)
       :bind (:map dired-mode-map
		   ("h" . dired-up-directory)
		   ("j" . dired-next-line)
		   ("k" . dired-previous-line)
		   ("l" . dired-single-buffer))
       :delight "Dired"
       :custom
       ;; (when (eq system-type 'darwin)
       ;;   (insert-directory-program "gls" dired-use-ls-dired t))
       (dired-auto-revert-buffer t)
       (dired-dwim-target t)
       (dired-hide-details-hide-symlink-targets nil)
       (dired-listing-switches "-alh --group-directories-first")
       (dired-ls-F-marks-symlinks nil)
       (dired-recursive-copies 'always))
   #+end_src

   To avoid =dired= to keep buffers, I use [[https://github.com/crocket/dired-single][dired-single]].

   #+begin_src emacs-lisp
     (use-package dired-single
       :after dired
       :bind (:map dired-mode-map
		   ([remap dired-find-file] . dired-single-buffer)
		   ([remap dired-up-directory] . dired-single-up-directory)
		   ("M-DEL" . dired-prev-subdir)))
   #+end_src

   By default, =dired= opens files in plain text. This behavior is sometimes undesirable. Hopefully, [[https://github.com/Fuco1/dired-hacks/blob/master/dired-open.el][dired-open]] can be used to informs =dired= that certain desired file extensions must be opened with external packages to GNU Emacs.

   #+begin_src emacs-lisp
     (use-package dired-open
       :after (dired dired-jump)
       :custom (dired-open-extensions '(("mp4" . "mpv"))))
   #+end_src

   To know the type of file at a glance, [[https://github.com/jtbm37/all-the-icons-dired][all-the-icons-dired]] integrates icons directly into =dired=.

   #+begin_src emacs-lisp
     (use-package all-the-icons-dired
       :if (display-graphic-p)
       :hook (dired-mode . all-the-icons-dired-mode))
   #+end_src

   It is sometimes convenient to hide dotfiles. With [[https://github.com/mattiasb/dired-hide-dotfiles][dired-hide-dotfiles]] this becomes possible.

   #+begin_src emacs-lisp
     (use-package dired-hide-dotfiles
       :hook (dired-mode . dired-hide-dotfiles-mode)
       :bind (:map dired-mode-map
		   ("H" . dired-hide-dotfiles-mode)))
   #+end_src

   I like being able to =<TAB>= on a folder and see its contents, without me getting into it. [[https://github.com/Fuco1/dired-hacks/blob/master/dired-subtree.el][dired-subtree]] allows this behavior.

   #+begin_src emacs-lisp
     (use-package dired-subtree
       :after dired
       :bind (:map dired-mode-map
		   ("<tab>" . dired-subtree-toggle)))
   #+end_src

   Finally, to manage folders with a large number of files, it may be useful to filter with [[https://github.com/Fuco1/dired-hacks/blob/master/dired-narrow.el][dired-narrow]]

   #+begin_src emacs-lisp
     (use-package dired-narrow
       :ensure nil
       :bind (("C-c C-n" . dired-narrow)
	      ("C-c C-f" . dired-narrow-fuzzy)))
   #+end_src

* PDF Tools

  #+BEGIN_SRC emacs-lisp
    (use-package pdf-tools
      :disabled
      :config
      (pdf-tools-install)
      )
  #+END_SRC

  Should I also install org-pdfview?

  #+BEGIN_SRC emacs-lisp
    (use-package org-pdfview
      :disabled
      )
  #+END_SRC

* Fonts and Bullets

  Set default font size
  
  When you have time, look here for reference: https://github.com/daviwil/dotfiles/blob/master/Emacs.org#fonts-and-bullets
  And also here if need be: https://zzamboni.org/post/beautifying-org-mode-in-emacs/

** Font settings

   #+BEGIN_SRC emacs-lisp
     ;; (set-face-attribute 'default nil :family "Source Code Pro")
     ;; (set-face-attribute 'default nil :height 165)
     ;; (set-fontset-font t 'latin "Noto Sans")
     ;; (set-face-attribute 'default nil :family "Menlo")
     ;; (set-face-attribute 'default nil :height 165)
     ;; (set-fontset-font t 'latin "Noto Sans")
   #+END_SRC

** Trying out unicode-fonts

   Does this even do anything?
   
   #+BEGIN_SRC emacs-lisp
     (use-package unicode-fonts
	:ensure t
	:config
	(unicode-fonts-setup))
   #+END_SRC

# https://github.com/dunn/company-emoji#emoji-font-support

   #+BEGIN_SRC emacs-lisp
     (if (version< "27.0" emacs-version)
         (set-fontset-font
          "fontset-default" 'unicode "Apple Color Emoji" nil 'prepend)
       (set-fontset-font
        t 'symbol (font-spec :family "Apple Color Emoji") nil 'prepend))

     (use-package company-emoji
       :ensure t)
     (use-package company
       :config
       ;; ...
       (add-to-list 'company-backends 'company-emoji))
   #+END_SRC

* Icons

To integrate icons with =doom-modeline= and other packages, [[https://github.com/domtronn/all-the-icons.el/][all-the-icons]] is the
best package that you can have with GNU Emacs. To download the icons on your
machine, you must run the =all-the-icons-install-fonts= command when you install
this package.

#+begin_src emacs-lisp
  (use-package all-the-icons
    :if (display-graphic-p)
    :commands all-the-icons-install-fonts
    :config (unless (find-font (font-spec :name "all-the-icons"))
              (all-the-icons-install-fonts t)))
#+end_src

* Indentation Guides
  The package below lets us heavily customize the indentation guide (i.e. shadows, characters, etc. to help us see the indentation easier). It is called =highlight-indent-guides= and can be found [[https://github.com/DarthFennec/highlight-indent-guides][here]].

  #+begin_src emacs-lisp :tangle no
    (use-package highlight-indent-guides
      :config
      (setq highlight-indent-guides-method 'bitmap)
      )

    (add-hook 'prog-mode-hook 'highlight-indent-guides-mode)
  #+end_src
  
* Spelling Correction
  I'm using flyspell, with ispell as the backend.
  On Linux, install with something like
  #+BEGIN_SRC bash :tangle no
    sudo apt install ispell
  #+END_SRC
  And on Mac...
  #+BEGIN_SRC bash :tangle no
    brew install ispell
  #+END_SRC

  Activate flyspell in text-mode buffers
  #+BEGIN_SRC emacs-lisp
    (dolist (hook '(text-mode-hook))
      (add-hook hook (lambda () (flyspell-mode 1))))
  #+END_SRC

* Markdown Mode (from [[https://jblevins.org/projects/markdown-mode/][here]])

  Enable markdown-mode

  #+BEGIN_SRC emacs-lisp
    (use-package markdown-mode
      :ensure t
      :commands (markdown-mode gfm-mode)
      :mode (("README\\.md\\'" . gfm-mode)
	     ("\\.md\\'" . markdown-mode)
	     ("\\.markdown\\'" . markdown-mode))
      :init (setq markdown-command "pandoc"))
  #+END_SRC


