init.el

(setq inhibit-startup-message t)                ; Not sure if I need this given setting in Better Defaults
(tool-bar-mode -1)                              ; Disable the toolbar
(tooltip-mode -1)                               ; Disable tooltips
(set-fringe-mode 10)                            ; Add fringe
(menu-bar-mode -1)                              ; Disable the menu bar
(setq visible-bell t)                           ; Activate visible bell
(scroll-bar-mode 1)

(setq mouse-wheel-scroll-amount '(1 ((shift) . 1))) ;; one line at a time
(setq mouse-wheel-progressive-speed nil) ;; don't accelerate scrolling
(setq mouse-wheel-follow-mouse 't) ;; scroll window under mouse
(setq scroll-step 1) ;; keyboard scroll one line at a time
(setq use-dialog-box nil) ;; Disable dialog boxes since they weren't working in Mac OSX

(column-number-mode)

;; Enable line numbers for some modes
(dolist (mode '(text-mode-hook
		prog-mode-hook
		conf-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 1))))

;; Override some modes which derive from the above
(dolist (mode '(org-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

(use-package centered-window
  :custom
  (cwm-centered-window-width 130)
  (cwm-frame-internal-border 0)
  (cwm-incremental-padding t)
  (cwm-incremental-padding-% 2)
  (cwm-left-fringe-ratio 0)
  (cwm-use-vertical-padding t)
  :config (centered-window-mode))

(use-package switch-window
  :bind (("C-x o" . switch-window)
	 ("C-x w" . switch-window-then-swap-buffer)))

(use-package dired
  :ensure nil
  :commands (dired dired-jump)
  :bind (:map dired-mode-map
	      ("h" . dired-up-directory)
	      ("j" . dired-next-line)
	      ("k" . dired-previous-line)
	      ("l" . dired-single-buffer))
  :delight "Dired"
  :custom
  ;; (when (eq system-type 'darwin)
  ;;   (insert-directory-program "gls" dired-use-ls-dired t))
  (dired-auto-revert-buffer t)
  (dired-dwim-target t)
  (dired-hide-details-hide-symlink-targets nil)
  (dired-listing-switches "-alh --group-directories-first")
  (dired-ls-F-marks-symlinks nil)
  (dired-recursive-copies 'always))

(use-package dired-single
  :after dired
  :bind (:map dired-mode-map
	      ([remap dired-find-file] . dired-single-buffer)
	      ([remap dired-up-directory] . dired-single-up-directory)
	      ("M-DEL" . dired-prev-subdir)))

(use-package dired-open
  :after (dired dired-jump)
  :custom (dired-open-extensions '(("mp4" . "mpv"))))

(use-package all-the-icons-dired
  :if (display-graphic-p)
  :hook (dired-mode . all-the-icons-dired-mode))

(use-package dired-hide-dotfiles
  :hook (dired-mode . dired-hide-dotfiles-mode)
  :bind (:map dired-mode-map
	      ("H" . dired-hide-dotfiles-mode)))

(use-package dired-subtree
  :after dired
  :bind (:map dired-mode-map
	      ("<tab>" . dired-subtree-toggle)))

(use-package dired-narrow
  :ensure nil
  :bind (("C-c C-n" . dired-narrow)
	 ("C-c C-f" . dired-narrow-fuzzy)))

(use-package pdf-tools
  :disabled
  :config
  (pdf-tools-install)
  )

(use-package org-pdfview
  :disabled
  )

;; (set-face-attribute 'default nil :family "Source Code Pro")
;; (set-face-attribute 'default nil :height 165)
;; (set-fontset-font t 'latin "Noto Sans")
;; (set-face-attribute 'default nil :family "Menlo")
;; (set-face-attribute 'default nil :height 165)
;; (set-fontset-font t 'latin "Noto Sans")

(use-package unicode-fonts
   :ensure t
   :config
   (unicode-fonts-setup))

(if (version< "27.0" emacs-version)
    (set-fontset-font
     "fontset-default" 'unicode "Apple Color Emoji" nil 'prepend)
  (set-fontset-font
   t 'symbol (font-spec :family "Apple Color Emoji") nil 'prepend))

(use-package company-emoji
  :ensure t)
(use-package company
  :config
  ;; ...
  (add-to-list 'company-backends 'company-emoji))

(use-package all-the-icons
  :if (display-graphic-p)
  :commands all-the-icons-install-fonts
  :config (unless (find-font (font-spec :name "all-the-icons"))
            (all-the-icons-install-fonts t)))

(dolist (hook '(text-mode-hook))
  (add-hook hook (lambda () (flyspell-mode 1))))

(use-package markdown-mode
  :ensure t
  :commands (markdown-mode gfm-mode)
  :mode (("README\\.md\\'" . gfm-mode)
	 ("\\.md\\'" . markdown-mode)
	 ("\\.markdown\\'" . markdown-mode))
  :init (setq markdown-command "pandoc"))
